# Вибір базового образу Node.js
FROM node:16

# Встановлення робочої директорії в контейнері
WORKDIR /usr/src/app

# Копіювання package.json і package-lock.json для встановлення залежностей
COPY package*.json ./

# Встановлення залежностей
RUN npm install

# Копіювання всіх файлів проекту в контейнер
COPY . .

# Відкриття порту 8089 (згідно з вашим прикладом)
EXPOSE 8089

# Команда запуску сервера через npm start із необхідними параметрами
CMD ["npm", "start", "--", "--host", "0.0.0.0", "--port", "8089", "--cache", "./cache"]
